<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"4b291bb270ee259bf709bf78289ba318cef246777976c4e56707838fe7a3f036","plan_job_ref":"Job .github/workflows/_test-tf.yaml #227 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11948437397","plan_out_hash":"7a1b8c81eac3502b7a80bb6ace0ed9d0a3fe5a7aa2e7819bcf9d08dc414eaa2c","plan_hash":"2fbf4922b1480caeda96a9bf42acb6f95ddfd37debda2102783afcf001e17e50","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #227](https://github.com/tx-pts-dai/github-workflows/actions/runs/11948437397)